FourPhaseSimulation/DNSCase02/constant/bubbleCloudProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      bubbleCloudProperties;
}

solution
{
    active          true;
    coupled         true;
    transient       yes;
    cellValueSourceCorrection off;
    interpolationSchemes { rho cell; U cellPoint; mu cell; }
    integrationSchemes   { U Euler; }
    sourceTerms          { schemes { U semiImplicit 1; } }
}

constantProperties
{
    rho0            1.2;
    youngsModulus   1e5;
    poissonsRatio   0.35;
}

subModels
{
    particleForces
    {
        sphereDrag;
        gravity;
    }

    injectionModels
    {
        model1
        {
            type                patchInjection;
            patch           bottom;
            U0                  (0 0.15 0);       // rising upward 15 cm/s
            massTotal           0;
            parcelBasisType     fixed;
            nParticle           1;
            SOI                 0;
            duration            2.0;
            parcelsPerSecond    5;
            flowRateProfile     constant 1;
            sizeDistribution
            {
                type        fixedValue;
                fixedValueDistribution { value 500e-6; }
            }
        }
    }

    dispersionModel             none;
    patchInteractionModel       standardWallInteraction;
    surfaceFilmModel            none;
    stochasticCollisionModel    none;
    collisionModel              none;
    packingModel                none;
    dampingModel                none;
    isotropyModel               none;

    standardWallInteractionCoeffs { type rebound; e 1; mu 0; }
}
