FourPhaseSimulation/DNSCase02/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes      { default Euler; }
gradSchemes     { default Gauss linear; }

divSchemes
{
    default                                     none;
    div(rhoPhi,U)                               Gauss linearUpwind grad(U);
    div(phi,alpha)                              Gauss vanLeer;
    div(phirb,alpha)                            Gauss linear;
    div(phi,alpha.water)                        Gauss vanLeer;
    div(phi,alpha.oil)                          Gauss vanLeer;
    div(phi,alpha.air)                          Gauss vanLeer;
    div(((rho*nuEff)*dev2(T(grad(U)))))          Gauss linear;
}

laplacianSchemes    { default Gauss linear corrected; }
interpolationSchemes { default linear; }
snGradSchemes       { default corrected; }

fluxRequired
{
    default     no;
    p_rgh       yes;
    alpha.water yes;
    alpha.oil   yes;
}
